In [122]:
import pandas as pd
s=pd.Series([1,3,5])
print(s)

0    1
1    3
2    5
dtype: int64

In [123]:
import pandas as pd
s=pd.series([1,3,5])
print(s)

AttributeError: module 'pandas' has no attribute 'series'

In [124]:
import pandas as pd
s=pd.Series(['ab','bc','ca'])
print(s)

0    ab
1    bc
2    ca
dtype: object

In [125]:
import pandas as pd
s=pd.Series([1,3,4])
print(s)
print(s[2])
print(s[1])
print(s[1:])
print(s[::-1])
#print(s[-1])
print(s[-4:-1])

0    1
1    3
2    4
dtype: int64
4
3
1    3
2    4
dtype: int64
2    4
1    3
0    1
dtype: int64
0    1
1    3
dtype: int64

In [126]:
print(s[-4:-1])

0    1
1    3
dtype: int64

In [127]:
pd.Series([0,1,2],index=['a','b','c'])

a    0
b    1
c    2
dtype: int64

In [128]:
pd.Series([22,23,34],index=pd.date_range('22-11-2019','24-11-2019'))

2019-11-22    22
2019-11-23    23
2019-11-24    34
Freq: D, dtype: int64

In [129]:
pd.Series([22,23,34,44,55],index=pd.date_range('22-11-2019','26-11-2019'))

2019-11-22    22
2019-11-23    23
2019-11-24    34
2019-11-25    44
2019-11-26    55
Freq: D, dtype: int64

In [130]:
pd.Series([22,23,34,44,55,44,55,66,6],index=pd.date_range('22-11-2019','26-11-2019'))

ValueError: Length of passed values is 9, index implies 5

In [131]:
import numpy as np
pd.Series(np.array(range(0,10))**2, index = range(0,10))

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int32

In [132]:
import numpy as np
pd.Series(np.array(range(0,10))**2, index = range(0,20))

ValueError: Length of passed values is 10, index implies 20

In [133]:
import numpy as np
pd.Series(np.array(range(0,20))**2, index = range(0,10))

ValueError: Length of passed values is 20, index implies 10

In [134]:
import pandas as pd
data=[['surya',10],['venkat',12],['venkata',13]]
df=pd.DataFrame(data,columns=['Name','Age'])
print(df)

      Name  Age
0    surya   10
1   venkat   12
2  venkata   13

In [135]:
import pandas as pd
data=[['surya',10],['venkat',12,'efefrwe'],['venkata',13]]
df=pd.DataFrame(data,columns=['Name','Age'])
print(df)

AssertionError: 2 columns passed, passed data had 3 columns

In [136]:
import pandas as pd
data=[['surya',10],['venkat',12,'efefrwe'],['venkata',13]]
df=pd.DataFrame(data,columns=['Name','Age','hello'])
print(df)

      Name  Age    hello
0    surya   10     None
1   venkat   12  efefrwe
2  venkata   13     None

In [ ]:
import pandas as pd
internal1={'s1':21,'s2':18,'s3':24}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':11,'s2':22,'s3':33}
internal2=pd.Series(internal2)
print(internal2)
print(internal1,'\n',internal2)

In [ ]:
final={'Internal1':internal1,'Internal2':internal2}
final=pd.DataFrame(final)
final['Internal1']
final

In [ ]:
final={'Internal1':internal1,'Internal2':internal2}
final=pd.DataFrame(final)
final['Internal2']
final

In [ ]:
df=pd.DataFrame({'name':['surya','narayana'],'age':[22,33],'occupation':['engineer','doctor']})

In [ ]:
filepath='Students.csv'
df=pd.read_csv(filepath)
df

In [ ]:
for row in df.values:
    print(row[2],':',row[-1])

In [ ]:
sum=0
for i in range(2,11):
    sum+=df.values[1][1:]
print(sum)

# sum/len(df.values[2][2:])

In [ ]:
import matplotlib.pyplot as plt
plt.title("Basic Linear graph")
plt.plot([1,2,3],[1,2,3])
plt.show()

In [ ]:
import matplotlib.pyplot as plt
plt.title("Basic Linear graph")
plt.plot([1,2,3],[5,6,7])
plt.show()

In [ ]:
import matplotlib.pyplot as plt
plt.title("Basic Linear graph")
plt.plot([-1,-2,-3],[1,2,3])
plt.show()

In [ ]:
import matplotlib.pyplot as plt
plt.title("Basic Linear graph")
plt.plot([-1,-2,-3],[-1,-2,-3])
plt.show()

In [ ]:
distance=list(range(2,11,2))
time=list(range(1,6))
plt.title("Distance vs time")
plt.xlabel("Time")
plt.xlabel("Distance")
plt.plot(time,distance,'yo')
plt.grid()
plt.show()

In [ ]:
distance=list(range(2,11,2))
time=list(range(1,6))
plt.title("Distance vs time")
plt.xlabel("Time")
plt.xlabel("Distance")
plt.plot(distance,time,'yo')
plt.grid()
plt.show()

In [ ]:
import numpy as np
t=np.arange(0.1,2.0,0.1)
v=[1+np.sin(2*np.pi*i) for i in t]
plt.plot(t,v)
plt.grid()
plt.xlabel("time")
plt.ylabel("voltage")
plt.title("Time vs voltage")
plt.savefig("surya.png")
plt.show()

In [ ]:
#Pandas

In [137]:
import pandas as pd

In [138]:
a=pd.Series([1,2,3,4,5])

In [139]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [140]:
type(a)

pandas.core.series.Series

In [141]:
a[2]

3

In [142]:
a[::-1]

4    5
3    4
2    3
1    2
0    1
dtype: int64

In [143]:
a[-3:-1]

2    3
3    4
dtype: int64

In [144]:
a[-1:]

4    5
dtype: int64

In [145]:
a=pd.Series(['a','b','c',11])

In [146]:
a

0     a
1     b
2     c
3    11
dtype: object

In [147]:
a=pd.date_range(start='08-01-2019', end = '20-08-2019')

In [148]:
a

DatetimeIndex(['2019-08-01', '2019-08-02', '2019-08-03', '2019-08-04',
               '2019-08-05', '2019-08-06', '2019-08-07', '2019-08-08',
               '2019-08-09', '2019-08-10', '2019-08-11', '2019-08-12',
               '2019-08-13', '2019-08-14', '2019-08-15', '2019-08-16',
               '2019-08-17', '2019-08-18', '2019-08-19', '2019-08-20'],
              dtype='datetime64[ns]', freq='D')

In [149]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

In [150]:
# Pandas DataFrame

In [151]:
import numpy as np

In [152]:
temp=np.random.randint(low=10,high=100,size=[20])
print(temp)

[23 92 36 76 88 78 20 69 12 76 19 62 74 88 57 80 82 79 13 34]

In [153]:
name=np.random.choice(['surya','venkat','narayana','narla'],20)
print(name)

['surya' 'surya' 'narayana' 'venkat' 'venkat' 'venkat' 'narla' 'surya'
 'venkat' 'narayana' 'surya' 'narayana' 'venkat' 'venkat' 'surya' 'venkat'
 'narla' 'narla' 'surya' 'narayana']

In [154]:
av=np.random.choice([10,12,13,34,56],20)

In [155]:
print(av)

[56 34 12 56 13 34 56 10 34 12 56 34 12 12 12 56 10 13 56 10]

In [156]:
a=list(zip(temp,name,av))

In [157]:
print(a)

[(23, 'surya', 56), (92, 'surya', 34), (36, 'narayana', 12), (76, 'venkat', 56), (88, 'venkat', 13), (78, 'venkat', 34), (20, 'narla', 56), (69, 'surya', 10), (12, 'venkat', 34), (76, 'narayana', 12), (19, 'surya', 56), (62, 'narayana', 34), (74, 'venkat', 12), (88, 'venkat', 12), (57, 'surya', 12), (80, 'venkat', 56), (82, 'narla', 10), (79, 'narla', 13), (13, 'surya', 56), (34, 'narayana', 10)]

In [158]:
df=pd.DataFrame(data=a,columns=['rollno','name','data'])
print(df)

    rollno      name  data
0       23     surya    56
1       92     surya    34
2       36  narayana    12
3       76    venkat    56
4       88    venkat    13
5       78    venkat    34
6       20     narla    56
7       69     surya    10
8       12    venkat    34
9       76  narayana    12
10      19     surya    56
11      62  narayana    34
12      74    venkat    12
13      88    venkat    12
14      57     surya    12
15      80    venkat    56
16      82     narla    10
17      79     narla    13
18      13     surya    56
19      34  narayana    10

In [159]:
type(df)

pandas.core.frame.DataFrame

In [160]:
df=pd.DataFrame({'temp':temp,'name':name,'av':av})
print(df)

    temp      name  av
0     23     surya  56
1     92     surya  34
2     36  narayana  12
3     76    venkat  56
4     88    venkat  13
5     78    venkat  34
6     20     narla  56
7     69     surya  10
8     12    venkat  34
9     76  narayana  12
10    19     surya  56
11    62  narayana  34
12    74    venkat  12
13    88    venkat  12
14    57     surya  12
15    80    venkat  56
16    82     narla  10
17    79     narla  13
18    13     surya  56
19    34  narayana  10

In [161]:
type(df)

pandas.core.frame.DataFrame

In [162]:
df.head()

   temp      name  av
0    23     surya  56
1    92     surya  34
2    36  narayana  12
3    76    venkat  56
4    88    venkat  13

In [163]:
df.tail()

    temp      name  av
15    80    venkat  56
16    82     narla  10
17    79     narla  13
18    13     surya  56
19    34  narayana  10

In [164]:
df.shape

(20, 3)

In [165]:
df.columns

Index(['temp', 'name', 'av'], dtype='object')

In [166]:
df.name

0        surya
1        surya
2     narayana
3       venkat
4       venkat
5       venkat
6        narla
7        surya
8       venkat
9     narayana
10       surya
11    narayana
12      venkat
13      venkat
14       surya
15      venkat
16       narla
17       narla
18       surya
19    narayana
Name: name, dtype: object

In [167]:
df['name']

0        surya
1        surya
2     narayana
3       venkat
4       venkat
5       venkat
6        narla
7        surya
8       venkat
9     narayana
10       surya
11    narayana
12      venkat
13      venkat
14       surya
15      venkat
16       narla
17       narla
18       surya
19    narayana
Name: name, dtype: object

In [168]:
df['temp']

0     23
1     92
2     36
3     76
4     88
5     78
6     20
7     69
8     12
9     76
10    19
11    62
12    74
13    88
14    57
15    80
16    82
17    79
18    13
19    34
Name: temp, dtype: int32

In [169]:
df['temp'].describe()

count    20.000000
mean     57.900000
std      28.367698
min      12.000000
25%      31.250000
50%      71.500000
75%      79.250000
max      92.000000
Name: temp, dtype: float64

In [170]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
temp    20 non-null int32
name    20 non-null object
av      20 non-null int32
dtypes: int32(2), object(1)
memory usage: 400.0+ bytes

In [171]:
df.values

array([[23, 'surya', 56],
       [92, 'surya', 34],
       [36, 'narayana', 12],
       [76, 'venkat', 56],
       [88, 'venkat', 13],
       [78, 'venkat', 34],
       [20, 'narla', 56],
       [69, 'surya', 10],
       [12, 'venkat', 34],
       [76, 'narayana', 12],
       [19, 'surya', 56],
       [62, 'narayana', 34],
       [74, 'venkat', 12],
       [88, 'venkat', 12],
       [57, 'surya', 12],
       [80, 'venkat', 56],
       [82, 'narla', 10],
       [79, 'narla', 13],
       [13, 'surya', 56],
       [34, 'narayana', 10]], dtype=object)

In [172]:
df.set_index('temp')

          name  av
temp
23       surya  56
92       surya  34
36    narayana  12
76      venkat  56
88      venkat  13
78      venkat  34
20       narla  56
69       surya  10
12      venkat  34
76    narayana  12
19       surya  56
62    narayana  34
74      venkat  12
88      venkat  12
57       surya  12
80      venkat  56
82       narla  10
79       narla  13
13       surya  56
34    narayana  10

In [173]:
df.set_index('temp',inplace=True)
print(df)

          name  av
temp
23       surya  56
92       surya  34
36    narayana  12
76      venkat  56
88      venkat  13
78      venkat  34
20       narla  56
69       surya  10
12      venkat  34
76    narayana  12
19       surya  56
62    narayana  34
74      venkat  12
88      venkat  12
57       surya  12
80      venkat  56
82       narla  10
79       narla  13
13       surya  56
34    narayana  10

In [174]:
df.sort_index(axis=0,ascending=False)

          name  av
temp
92       surya  34
88      venkat  13
88      venkat  12
82       narla  10
80      venkat  56
79       narla  13
78      venkat  34
76      venkat  56
76    narayana  12
74      venkat  12
69       surya  10
62    narayana  34
57       surya  12
36    narayana  12
34    narayana  10
23       surya  56
20       narla  56
19       surya  56
13       surya  56
12      venkat  34

In [175]:
df.sort_values(by='av',ascending=False)

          name  av
temp
23       surya  56
20       narla  56
13       surya  56
80      venkat  56
19       surya  56
76      venkat  56
78      venkat  34
12      venkat  34
92       surya  34
62    narayana  34
88      venkat  13
79       narla  13
76    narayana  12
74      venkat  12
88      venkat  12
57       surya  12
36    narayana  12
69       surya  10
82       narla  10
34    narayana  10

In [179]:
df.sort_values(by='av',ascending=True)

          name  av
temp
34    narayana  10
82       narla  10
69       surya  10
57       surya  12
88      venkat  12
74      venkat  12
76    narayana  12
36    narayana  12
88      venkat  13
79       narla  13
78      venkat  34
12      venkat  34
62    narayana  34
92       surya  34
13       surya  56
19       surya  56
76      venkat  56
80      venkat  56
20       narla  56
23       surya  56

In [180]:
df

          name  av
temp
23       surya  56
92       surya  34
36    narayana  12
76      venkat  56
88      venkat  13
78      venkat  34
20       narla  56
69       surya  10
12      venkat  34
76    narayana  12
19       surya  56
62    narayana  34
74      venkat  12
88      venkat  12
57       surya  12
80      venkat  56
82       narla  10
79       narla  13
13       surya  56
34    narayana  10

In [177]:
df.drop(['av'],axis=1)

          name
temp
23       surya
92       surya
36    narayana
76      venkat
88      venkat
78      venkat
20       narla
69       surya
12      venkat
76    narayana
19       surya
62    narayana
74      venkat
88      venkat
57       surya
80      venkat
82       narla
79       narla
13       surya
34    narayana

In [178]:
df

          name  av
temp
23       surya  56
92       surya  34
36    narayana  12
76      venkat  56
88      venkat  13
78      venkat  34
20       narla  56
69       surya  10
12      venkat  34
76    narayana  12
19       surya  56
62    narayana  34
74      venkat  12
88      venkat  12
57       surya  12
80      venkat  56
82       narla  10
79       narla  13
13       surya  56
34    narayana  10

In [181]:
df.head()

          name  av
temp
23       surya  56
92       surya  34
36    narayana  12
76      venkat  56
88      venkat  13

In [182]:
df.tail()

          name  av
temp
80      venkat  56
82       narla  10
79       narla  13
13       surya  56
34    narayana  10

In [188]:
df

          name  av
temp
23       surya  56
92       surya  34
36    narayana  12
76      venkat  56
88      venkat  13
78      venkat  34
20       narla  56
69       surya  10
12      venkat  34
76    narayana  12
19       surya  56
62    narayana  34
74      venkat  12
88      venkat  12
57       surya  12
80      venkat  56
82       narla  10
79       narla  13
13       surya  56
34    narayana  10

In [183]:
df.iloc[[0,1]]

       name  av
temp
23    surya  56
92    surya  34

In [185]:
df.iloc[1:3,1] # In this indexes cannot be counted here 1 is av

temp
92    34
36    12
Name: av, dtype: int32

In [186]:
df.iloc[[True,True,False,True]]

        name  av
temp
23     surya  56
92     surya  34
76    venkat  56

In [187]:
df

          name  av
temp
23       surya  56
92       surya  34
36    narayana  12
76      venkat  56
88      venkat  13
78      venkat  34
20       narla  56
69       surya  10
12      venkat  34
76    narayana  12
19       surya  56
62    narayana  34
74      venkat  12
88      venkat  12
57       surya  12
80      venkat  56
82       narla  10
79       narla  13
13       surya  56
34    narayana  10

In [189]:
df.iloc[0,:]

name    surya
av         56
Name: 23, dtype: object

In [190]:
df.head()

          name  av
temp
23       surya  56
92       surya  34
36    narayana  12
76      venkat  56
88      venkat  13

In [191]:
df.loc[92]

name    surya
av         34
Name: 92, dtype: object

In [193]:
df.loc[[79,13,34]]

          name  av
temp
79       narla  13
13       surya  56
34    narayana  10

In [194]:
df.loc[[True,True,False]]

       name  av
temp
23    surya  56
92    surya  34

In [195]:
df.loc[df.av>13]

          name  av
temp
23       surya  56
92       surya  34
76      venkat  56
78      venkat  34
20       narla  56
12      venkat  34
19       surya  56
62    narayana  34
80      venkat  56
13       surya  56

In [196]:
df.loc[(df.av>14) | (df.av==10)]
print(df)

          name  av
temp
23       surya  56
92       surya  34
36    narayana  12
76      venkat  56
88      venkat  13
78      venkat  34
20       narla  56
69       surya  10
12      venkat  34
76    narayana  12
19       surya  56
62    narayana  34
74      venkat  12
88      venkat  12
57       surya  12
80      venkat  56
82       narla  10
79       narla  13
13       surya  56
34    narayana  10

In [197]:
df.loc[(df.av==10)]

          name  av
temp
69       surya  10
82       narla  10
34    narayana  10

In [198]:
# Merging

In [199]:
d1=pd.DataFrame([['a',1],['b',2]],columns=['col1','number'])
print(d1)

  col1  number
0    a       1
1    b       2

In [200]:
d2=pd.DataFrame([['c',3,'lion'],['d',4,'tiger']],columns=['letter','number','animal'])
print(d2)

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [201]:
pd.concat([d1,d2],axis=0)

C:\Users\Satya\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
0   lion  NaN      c       3
1  tiger  NaN      d       4

In [203]:
pd.concat([d1,d2],axis=0,ignore_index=True)

C:\Users\Satya\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
2   lion  NaN      c       3
3  tiger  NaN      d       4

In [206]:
pd.concat([d1,d2],axis=1)

  col1  number letter  number animal
0    a       1      c       3   lion
1    b       2      d       4  tiger